{
  "posts": [
    {
      "id": 1,
      "title": "How To Use Multithreading in Node.js",
      "author": "Tin Tran",
      "description": "Node.js runs JavaScript code in a single thread, which means that your code can only do one task at a time. However, Node.js itself is multithreaded and provides hidden threads through the libuv library, which handles I/O operations like reading files from a disk or network requests. Through the use of hidden threads, Node.js provides asynchronous methods that allow your code to make I/O requests without blocking the main thread."
    },
    {
      "id": 2,
      "title": "From Side Project to Startup",
      "author": "Huy Ngo",
      "description": "Looking back in time and seeing a year has passed, building a product from scratch is overwhelming. Too many thoughts, learnings, wins, and failures but a journey worth cherishing. On this note, and without boring you much, gonna straight jump to the topic of discussion"
    },
    {
      "id": 3,
      "title": "Javascript to know for Reactjs",
      "author": "Thien Lam",
      "description": "Learning React js should not be that difficult if you're already comfortable with some concepts in Javascript. One of the interesting things about using reactjs is, it sharpens your javascript skills, but hey before you decide to give react js a try, do make sure to understand these javascripts concepts."
    }
  ],
  "accorditions": [
    {
      "id": 0,
      "title": "Call of the Night",
      "content": "Yofukashi no Uta là một bộ manga Nhật Bản được viết và minh họa bởi Kotoyama. Bộ truyện đã được đăng dài kỳ trên tạp chí manga Weekly Shōnen Sunday của nhà xuất bản Shogakukan từ tháng 8 năm 2019. Ở Bắc Mỹ, bộ truyện được xuất bản tiếng Anh bởi Viz Media."
    },
    {
      "id": 1,
      "title": "Rent a Girlfriend Season 2",
      "content": "Một thằng Zin tên là Kazuya 19 năm mới có bồ không bao lâu thì bị đá, thế là cậu ta phải sử dụng dịch vụ Hẹn hò Thuê, cứ trả tiền là ngày đó bạn sẽ có bạn gái ngay! Cậu ta đã thuê Mizuhara làm bạn gái mình, cô nàng thì cứ công việc (méo có yêu thương gì đâu) mà thả thính, còn chàng ta thì đớp thính vô tội vạ, cho đến khi… Đến khi Kazuya bớt sống ảo, cậu ta ngưng đớp thính và tự sẽ kiếm bạn gái thật cho mình thì mới hớ ra Mizuhara học cùng trường với mình, câu chuyện tình dở khóc dở cười này sẽ ra sao đây?"
    },
    {"id": 2, "title": "Lycoris Recoil", "content": "Câu chuyện lấy bối cảnh ở Lyco-Reco một quán cà phê kiểu Nhật ở khu trung tâm cổ kính của Tokyo. Quán cà phê nhận đặt hàng bất cứ thứ gì, từ cà phê ngon đến đồ ngọt... Bất kể bạn gọi món gì, chúng tôi sẽ phục vụ tận nơi...!"}
  ]
}
